FKDD_COPY_DIFF_3_2026-02-14/InformationRegisters/БТ_АдресатыЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>БТ_АдресатыЗаявок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УсловиеОтбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УсловиеОтбораКомпановка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УникальныйИдентификаторНастройки</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>УсловиеКомпановкаЗаполнено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодпискаНаСогласованныеЗаявки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КтоМенял</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбязательноеСогласование</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:EnumRef.БТ_РолиАдресатовЗаявок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидЗаявки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.БТ_ВидыЗаявок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Согласующий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/Enums/БТ_СтатусыЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>БТ_СтатусыЗаявок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подготовлена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УтвержденаЦФО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УтвержденаКонтролером</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УтвержденаДЦ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УтвержденаФД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УтвержденаГДУК</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утверждена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УтвержденаКазначеня</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УтвержденаСотрудникЦФО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отказ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленоНаДоработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УтвержденаГДУИД</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-14/CommonModules/БТ_БизнесПроцессы/Ext/Module.bsl
Функция ПолучитьМассивПрименяемыхРолей(ВидЗаявки = Неопределено) Экспорт
	
	ВозвращаемыйМассив = Новый Массив();   
	
	Если ВидЗаявки = Перечисления.БТ_ВидыЗаявок.ЗаявкаНаСогласованиеЗаявокДДС Тогда   
		
		ВозвращаемыйМассив.Добавить(Перечисления.БТ_РолиАдресатовЗаявок.Бухгалтерия);
		ВозвращаемыйМассив.Добавить(Перечисления.БТ_РолиАдресатовЗаявок.ГенеральныйДиректорДЦ);  
		//ВозвращаемыйМассив.Добавить(Перечисления.БТ_РолиАдресатовЗаявок.ГенеральныйДиректорУК); //ЧалапАю БизТех 18.01.2024 - удаление точек маршрута
		ВозвращаемыйМассив.Добавить(Перечисления.БТ_РолиАдресатовЗаявок.Казначей);
		//ВозвращаемыйМассив.Добавить(Перечисления.БТ_РолиАдресатовЗаявок.РуководительЦФО);    //ЧалапАю БизТех 18.01.2024 - удаление точек маршрута
		ВозвращаемыйМассив.Добавить(Перечисления.БТ_РолиАдресатовЗаявок.СотрудникЦФО);
		//ВозвращаемыйМассив.Добавить(Перечисления.БТ_РолиАдресатовЗаявок.ФинансовыйДиректор);  //ЧалапАю БизТех 18.01.2024 - удаление точек маршрута
		//ВозвращаемыйМассив.Добавить(Перечисления.БТ_РолиАдресатовЗаявок.ГенеральныйДиректорИД);   //ЧалапАЮ БизТех 13.11.2023   //ЧалапАю БизТех 18.01.2024 - удаление точек маршрута
		
	Иначе	    
		
		ВозвращаемыйМассив = Неопределено;  
		
	КонецЕсли;       
	
	Возврат ВозвращаемыйМассив;
КонецФункции


Процедура ЗаписатьТаблицуОтветственныхВРегистр_Нов(ЗаявкаСсылка, Роль, ПроверятьНаличие = Ложь) Экспорт
	
	СписокОтветственных = РегистрыСведений.БТ_ОтветственныеПоЗаявкамПользователей.СоздатьНаборЗаписей();
	СписокОтветственных.Отбор.ЗаявкаПользователя.Установить(ЗаявкаСсылка);
	СписокОтветственных.Отбор.Роль.Установить(Роль);
	ТЗ = ВычислитьОтветственных_Нов(ЗаявкаСсылка, Роль);
	Если ПроверятьНаличие = Истина И ТЗ.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	СписокОтветственных.Загрузить(ТЗ);
	СписокОтветственных.Записать();
	
КонецПроцедуры

Функция ВычислитьОтветственных_Нов(ЗаявкаСсылка, Роль) Экспорт;
	
	ТаблицаОтветственных=Новый ТаблицаЗначений;
	ТаблицаОтветственных.Колонки.Добавить("ЗаявкаПользователя");
	ТаблицаОтветственных.Колонки.Добавить("Роль");
	ТаблицаОтветственных.Колонки.Добавить("Согласующий");
	
	
	МассивАдресатов	= ПолучитьСписокПодходящихАдресатовЗадачиКомпановка(ЗаявкаСсылка, Роль);
	МассивСтрокСОбязательнымиСогласующими = Новый Массив;
	Для Каждого Адресат Из МассивАдресатов Цикл
			СтрокаТаблицы	= ТаблицаОтветственных.Добавить();
			СтрокаТаблицы.ЗаявкаПользователя	= ЗаявкаСсылка;
			СтрокаТаблицы.Роль					= Роль;
			СтрокаТаблицы.Согласующий			= Адресат.Согласующий;	
	КонецЦикла;
	
	//удалим лишние строки по колонке НеУведомлятьПоПочте
	ц = 0;
	Пока ц < ТаблицаОтветственных.Количество() Цикл
		ФлагИнкрементаЦ = Истина;
		ц1 = 0;
		Пока ц1 < ТаблицаОтветственных.Количество() Цикл
			Строка1 = ТаблицаОтветственных[ц];
			Строка2 = ТаблицаОтветственных[ц1];
			
			Если ц <> ц1
				И Строка1.ЗаявкаПользователя = Строка2.ЗаявкаПользователя
				И Строка1.Роль = Строка2.Роль
				И Строка1.Согласующий = Строка2.Согласующий Тогда
				ТаблицаОтветственных.Удалить(Строка2);
				ФлагИнкрементаЦ = Ложь;
			Иначе
				ц1 = ц1 + 1;
			КонецЕсли;
		КонецЦикла;
		
		Если ФлагИнкрементаЦ Тогда
			ц = ц + 1;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ТаблицаОтветственных;
КонецФункции

Функция ПолучитьСписокПодходящихАдресатовЗадачиКомпановка(ЗаявкаСсылка, Знач Роль) Экспорт
	
	МассивПолученныхАдресатов = Новый Массив();
	
	ЗапросАдресатов=Новый Запрос;
	ЗапросАдресатов.Текст="ВЫБРАТЬ
	                      |	АдресатыЗаявок.Согласующий КАК Согласующий,
	                      |	АдресатыЗаявок.УсловиеОтбораКомпановка КАК УсловиеОтбораКомпановка
	                      |ИЗ
	                      |	РегистрСведений.БТ_АдресатыЗаявок КАК АдресатыЗаявок
	                      |ГДЕ
	                      |	АдресатыЗаявок.Роль = &Роль
	                      |	И АдресатыЗаявок.ВидЗаявки = &ВидЗаявки";
	
	Если ТипЗнч(ЗаявкаСсылка) = Тип("БизнесПроцессСсылка.БТ_СогласованиеЗаявокДДС") Тогда
		ВидЗаявки = ПредопределенноеЗначение("Перечисление.БТ_ВидыЗаявок.ЗаявкаНаСогласованиеЗаявокДДС");
	КонецЕсли;
	
	ЗапросАдресатов.УстановитьПараметр("ВидЗаявки"	, ВидЗаявки);
	ЗапросАдресатов.УстановитьПараметр("Роль"		, Роль);
	РезультатАдресатов=ЗапросАдресатов.Выполнить();
	
	Если Не РезультатАдресатов.Пустой() Тогда
		
		ВыборкаАдресатов = РезультатАдресатов.Выбрать();
		
		Если ВидЗаявки = Перечисления.БТ_ВидыЗаявок.ЗаявкаНаСогласованиеЗаявокДДС Тогда
			СКД   = РегистрыСведений.БТ_АдресатыЗаявок.ПолучитьМакет("ЗаявкаНаСогласованиеЗаявокДДС");
		КонецЕсли;
		
		КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
		АдресВременногоХранилищаСхемы = ПоместитьВоВременноеХранилище(СКД);
		КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресВременногоХранилищаСхемы));
		
		
		
		Пока ВыборкаАдресатов.Следующий() Цикл
			
			
			НастройкиАдресата = ВыборкаАдресатов.УсловиеОтбораКомпановка.Получить();
			
			Если Не ЗначениеЗаполнено(НастройкиАдресата) Тогда
				Продолжить;
			КонецЕсли;
			
			КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиАдресата);
			КомпоновщикНастроек.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.Полное);	
			Настройки = КомпоновщикНастроек.ПолучитьНастройки();
			ЗаявкаПараметр = Настройки.ПараметрыДанных.Элементы.Найти("Заявка");
			ЗаявкаПараметр.Значение			= ЗаявкаСсылка;
			ЗаявкаПараметр.Использование	= Истина;     
			КомпоновщикМакета	= Новый КомпоновщикМакетаКомпоновкиДанных;
			МакетКомпоновки		= КомпоновщикМакета.Выполнить(СКД, Настройки, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
			ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
			ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
			
			ФормируемаяСтруктура = Новый Структура();
			НомераУтверждаемыхСтрок = Новый Массив();
			
			ЭлементРезультата = ПроцессорКомпоновкиДанных.Следующий();
			Пока ЭлементРезультата <> Неопределено Цикл
				КоличествоПараметров = ЭлементРезультата.ЗначенияПараметров.Количество();
				Если КоличествоПараметров = 1 Тогда
					МетаданныеОбъекта = Метаданные.НайтиПоТипу(ТипЗнч(ЭлементРезультата.ЗначенияПараметров[0].Значение));
					Если МетаданныеОбъекта <> Неопределено Тогда
						Если Метаданные.БизнесПроцессы.Содержит(МетаданныеОбъекта)
							ИЛИ Метаданные.Справочники.Содержит(МетаданныеОбъекта)
							ИЛИ Метаданные.Документы.Содержит(МетаданныеОбъекта) Тогда
							ФормируемаяСтруктура.Вставить("Согласующий"	, ВыборкаАдресатов.Согласующий);
							//Прервать;
						КонецЕсли;
					КонецЕсли;
				ИначеЕсли КоличествоПараметров > 1 Тогда
					Для каждого ТекПараметр Из ЭлементРезультата.ЗначенияПараметров Цикл
						Если ТипЗнч(ТекПараметр.Значение) = Тип("Число") Тогда
							НомераУтверждаемыхСтрок.Добавить(ТекПараметр.Значение);
						КонецЕсли;
					КонецЦикла;
					//Прервать;   
				КонецЕсли;
				ЭлементРезультата = ПроцессорКомпоновкиДанных.Следующий();
			КонецЦикла;
			
			Если ФормируемаяСтруктура.Свойство("Согласующий") Тогда
				
				МассивПолученныхАдресатов.Добавить(ФормируемаяСтруктура);
 
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Возврат МассивПолученныхАдресатов;
КонецФункции

Процедура СоздатьНовыеБизнесПроцессы(ЗаявкаОснование,
	ТочкаМаршрутаБизнесПроцесса,
	ФормируемыеБизнесПроцессы,
	Роль,
	ДопОпция = Неопределено,
	МожетИзменятьЗаявку	= Ложь,
	ОдинБПНаВсеСтроки	= Ложь,
	ПоУтверждающимОтдельно	= Ложь,
	УникальныйИдентификаторСтроки = Неопределено) Экспорт
	
	ВыборкаНомерСтрокиТЧ = ПолучитьВычисленныхСогласующихПоЗавке(ЗаявкаОснование, Роль, ОдинБПНаВсеСтроки);
			
	СоздатьНовыеБизнесПроцессыДалее(ЗаявкаОснование, ВыборкаНомерСтрокиТЧ, Роль, ТочкаМаршрутаБизнесПроцесса, МожетИзменятьЗаявку, ФормируемыеБизнесПроцессы, ДопОпция);
		
КонецПроцедуры  

Функция ПолучитьВычисленныхСогласующихПоЗавке(ЗаявкаОснование,Роль,ОдинБПНаВсеСтроки =  Ложь, УникальныйИдентификаторСтроки = Неопределено) Экспорт 
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОтветственныеПоЗаявкамПользователей.ЗаявкаПользователя,
	|	ОтветственныеПоЗаявкамПользователей.Роль,
	|	ОтветственныеПоЗаявкамПользователей.Согласующий
	|ИЗ
	|	РегистрСведений.БТ_ОтветственныеПоЗаявкамПользователей КАК ОтветственныеПоЗаявкамПользователей
	|ГДЕ
	|	ОтветственныеПоЗаявкамПользователей.ЗаявкаПользователя = &ЗаявкаПользователя
	|	И ОтветственныеПоЗаявкамПользователей.Роль = &Роль";
	
	Запрос.УстановитьПараметр("ЗаявкаПользователя", ЗаявкаОснование);
	Запрос.УстановитьПараметр("Роль", Роль);
	Запрос.УстановитьПараметр("УникальныйИдентификаторСтроки", УникальныйИдентификаторСтроки);
	
	Возврат Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
КонецФункции

Процедура ДобавитьСогласующегоВЗаписьСтатусовЗаявок(ЗаявкаПользователя, Согласующий, НомерСтрокиТЧ = 0, Роль = Неопределено, ДатаВыполнения = Неопределено, ТочкаМаршрута = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтатусыЗаявокПоСтрокамСрезПоследних.Период КАК Период
	|ИЗ
	|	РегистрСведений.БТ_СтатусыЗаявокПоСтрокам.СрезПоследних(, ЗаявкаПользователя = &ЗаявкаПользователя) КАК СтатусыЗаявокПоСтрокамСрезПоследних";
	
	Запрос.УстановитьПараметр("ЗаявкаПользователя", ЗаявкаПользователя);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Набор = РегистрыСведений.БТ_СтатусыЗаявокПоСтрокам.СоздатьНаборЗаписей();
		Набор.Отбор.ЗаявкаПользователя.Установить(ЗаявкаПользователя);
		Набор.Отбор.Период.Установить(Выборка.Период);
		Набор.Прочитать();
		Для Каждого Запись Из Набор Цикл
			Запись.Согласующий = Согласующий;
			Если Роль <> Неопределено Тогда
				Запись.Роль = Роль;
			КонецЕсли;
			Если ДатаВыполнения <> Неопределено Тогда
				Запись.ДатаВыполнения = ДатаВыполнения;
			КонецЕсли;
			Если ТочкаМаршрута <> Неопределено Тогда
				Запись.ТочкаМаршрута = ТочкаМаршрута;
			КонецЕсли;
		КонецЦикла;
		Набор.Записать();
	КонецЦикла;
	
КонецПроцедуры


Процедура СоздатьНовыеБизнесПроцессыДалее(	ЗаявкаОснование,
	ВыборкаНомерСтрокиТЧ,
	Роль,
	ТочкаМаршрутаБизнесПроцесса,
	МожетИзменятьЗаявку,
	ФормируемыеБизнесПроцессы,
	ДопОпция)
	Если ФормируемыеБизнесПроцессы.Количество() > 0 Тогда
		НовыйБП	= ФормируемыеБизнесПроцессы[0];
	Иначе
		НовыйБП	= БизнесПроцессы.БТ_УтвержденияЗаявок.СоздатьБизнесПроцесс();
	КонецЕсли;
	НовыйБП.Дата				= ТекущаяДата();
	НовыйБП.Исполнитель			= ЗаявкаОснование.Пользователь;
	НовыйБП.РольУтверждающего	= Роль;
	НовыйБП.Статус				= ПолучитьСтатусЗаявки(ТочкаМаршрутаБизнесПроцесса);
	//НовыйБП.ВидЗаявки			= Перечисления.БТ_ВидыЗаявок.ПолучитьВидЗаявки(ЗаявкаОснование);
	НовыйБП.ВидЗаявки			= Перечисления.БТ_ВидыЗаявок.ЗаявкаНаСогласованиеЗаявокДДС;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ОтветственныеПоЗаявкамПользователей.Согласующий КАК Согласующий
	                      |ИЗ
	                      |	РегистрСведений.БТ_ОтветственныеПоЗаявкамПользователей КАК ОтветственныеПоЗаявкамПользователей
	                      |ГДЕ
	                      |	ОтветственныеПоЗаявкамПользователей.ЗаявкаПользователя = &ЗаявкаПользователя
	                      |	И ОтветственныеПоЗаявкамПользователей.Роль = &Роль");
	Запрос.УстановитьПараметр("ЗаявкаПользователя"	, ЗаявкаОснование);
	Запрос.УстановитьПараметр("Роль"				, Роль);
	ВыборкаОтветственных = Запрос.Выполнить().Выбрать();
	
	ФормируемыеБизнесПроцессы.Добавить(НовыйБП);  
	
КонецПроцедуры

Функция ПолучитьСтатусЗаявки(ТочкаМаршрутаБизнесПроцесса) Экспорт       
	
	Если ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ТочкиМаршрута.УтверждениеБухгалтерия Тогда
		
		Возврат Перечисления.БТ_СтатусыЗаявок.УтвержденаКонтролером;
		
	ИначеЕсли ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ТочкиМаршрута.УтверждениеГенеральныйДиректорДЦ Тогда
		
		Возврат Перечисления.БТ_СтатусыЗаявок.УтвержденаДЦ;    
	//<<ЧалапАю БизТех 18.01.2024 - удаление точек маршрута
	//ИначеЕсли ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ТочкиМаршрута.УтверждениеГенеральныйДиректорУК Тогда
	//	
	//	Возврат Перечисления.БТ_СтатусыЗаявок.УтвержденаГДУК;  
	////<<чалапАЮ БизТех 13.11.2023
	//ИначеЕсли ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ТочкиМаршрута.УтверждениеИсполнительныйДиректор Тогда
	//	
	//	Возврат Перечисления.БТ_СтатусыЗаявок.УтвержденаГДУИД;
	////чалапАЮ БизТех 13.11.2023>>	  
	//ЧалапАю БизТех 18.01.2024 - удаление точек маршрута>>
		
	ИначеЕсли ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ТочкиМаршрута.УтверждениеКазначей Тогда
		
		Возврат Перечисления.БТ_СтатусыЗаявок.УтвержденаКазначеня;
		
	//<<ЧалапАю БизТех 18.01.2024 - удаление точек маршрута
	//ИначеЕсли ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ТочкиМаршрута.УтверждениеРуководительЦФО Тогда
	//	
	//	Возврат Перечисления.БТ_СтатусыЗаявок.УтвержденаЦФО;
	//ЧалапАю БизТех 18.01.2024 - удаление точек маршрута>>	
	ИначеЕсли ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ТочкиМаршрута.УтверждениеСотрудникЦФО Тогда
		
		Возврат Перечисления.БТ_СтатусыЗаявок.УтвержденаСотрудникЦФО;
		
	//<<ЧалапАю БизТех 18.01.2024 - удаление точек маршрута
	//ИначеЕсли ТочкаМаршрутаБизнесПроцесса = БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ТочкиМаршрута.УтверждениеФинансовыйДиректор Тогда
	//	
	//	Возврат Перечисления.БТ_СтатусыЗаявок.УтвержденаФД;
	//ЧалапАю БизТех 18.01.2024 - удаление точек маршрута>>	
	Иначе
		
		Возврат Перечисления.СтатусыВыполненияЗадачПоЗаявкам.ПустаяСсылка();
		
	КонецЕсли;
КонецФункции

Процедура УстановитьСтатусСтрокиЗаявки(ЗаявкаСсылка, Статус, Дата=Неопределено, Роль=Неопределено, ТочкаМаршрута=Неопределено, Согласующий=Неопределено, НомерСтрокиТЧ = 0, ТочкаМаршрутаИзменения=Неопределено) Экспорт
	Если НЕ ЗначениеЗаполнено(Статус) Тогда
		Возврат;
	КонецЕсли;
	
	Дата=?(Дата=Неопределено, ТекущаяДата(), Дата);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СтатусыЗаявокПоСтрокамСрезПоследних.Период КАК Период,
	                      |	СтатусыЗаявокПоСтрокамСрезПоследних.Статус КАК Статус
	                      |ИЗ
	                      |	РегистрСведений.БТ_СтатусыЗаявокПоСтрокам.СрезПоследних КАК СтатусыЗаявокПоСтрокамСрезПоследних
	                      |ГДЕ
	                      |	СтатусыЗаявокПоСтрокамСрезПоследних.ЗаявкаПользователя = &ЗаявкаПользователя");
	Запрос.УстановитьПараметр("ЗаявкаПользователя"	, ЗаявкаСсылка);
	Запрос.УстановитьПараметр("НомерСтрокиТЧ"		, НомерСтрокиТЧ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если Выборка.Статус = Статус Тогда
			Возврат;
		ИначеЕсли Выборка.Период = Дата Тогда
			Дата = Дата + 1;
		КонецЕсли;
	КонецЕсли;

	Запись = РегистрыСведений.БТ_СтатусыЗаявокПоСтрокам.СоздатьМенеджерЗаписи();
	Запись.Период					= Дата;
	Запись.Статус					= Статус;
	Запись.ЗаявкаПользователя		= ЗаявкаСсылка;
	Запись.Роль						= Роль;
	Запись.ТочкаМаршрута			= ТочкаМаршрута;
	Запись.Согласующий				= Согласующий;
	Запись.ТочкаМаршрутаИзменения	= ТочкаМаршрутаИзменения;
	Запись.Записать();
	
КонецПроцедуры

Процедура СогласоватьЗаявку(Заявки, ПроставитьОтмену = Ложь, ОТправленоНаДоработку = ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БТ_ЗадачиОбработкиЗаявокПользователя.Ссылка КАК Ссылка,
		|	1 КАК Поле1
		|ИЗ
		|	Задача.БТ_ЗадачиОбработкиЗаявокПользователя КАК БТ_ЗадачиОбработкиЗаявокПользователя
		|ГДЕ
		|	БТ_ЗадачиОбработкиЗаявокПользователя.БизнесПроцесс В(&БизнесПроцесс)
		|	И НЕ БТ_ЗадачиОбработкиЗаявокПользователя.Выполнена
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	БТ_ЗадачиУтверждения.Ссылка,
		|	NULL
		|ИЗ
		|	Задача.БТ_ЗадачиУтверждения КАК БТ_ЗадачиУтверждения
		|ГДЕ
		|	БТ_ЗадачиУтверждения.Заявка в (&БизнесПроцесс)
		|	И НЕ БТ_ЗадачиУтверждения.Выполнена";
	
	Запрос.УстановитьПараметр("БизнесПроцесс", Заявки);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл   
		
		Если ПроставитьОтмену Тогда
			
			ОбЗаявка = Выборка.Ссылка.ПолучитьОБъект();
			ОбЗаявка.Отменена = Истина;
			ОбЗаявка.Записать();
			
			//ЧалапАю БизТех 01.11.2023
		ИНачеЕсли ТипЗнч(Выборка.Ссылка) = Тип("ЗадачаСсылка.БТ_ЗадачиОбработкиЗаявокПользователя") и ОтправленоНаДоработку Тогда  
			ОбЗаявка = Выборка.Ссылка.ПолучитьОБъект(); 
			ОбЗаявка.ОтправленаНаДоработку = Истина;
			ОбЗаявка.Записать();
			ОбЗаявка.ВыполнитьЗадачу()  ;	

		ИначеЕсли ТипЗнч(Выборка.Ссылка) = Тип("ЗадачаСсылка.БТ_ЗадачиОбработкиЗаявокПользователя") Тогда
			
			ОбЗаявка = Выборка.Ссылка.ПолучитьОБъект();
			ОбЗаявка.ВыполнитьЗадачу()  ;                                                               
			
		Иначе         
			
			ОбЗаявка = Выборка.Ссылка.ПолучитьОБъект();
			ОбЗаявка.Выполнена = истина;
			ОбЗаявка.Записать();
			
		КонецЕсли;
		
	КонецЦикла;   
	
КонецПроцедуры     

Функция ПолучитьСписокТекущихТочекМаршрута(Заявка) Экспорт
	
	Запрос=Новый Запрос;
	
	Запрос.Текст="ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗадачиОбработкиЗаявокПользователя.ТочкаМаршрута
	|ИЗ
	|	Задача.БТ_ЗадачиОбработкиЗаявокПользователя КАК ЗадачиОбработкиЗаявокПользователя
	|ГДЕ
	|	НЕ ЗадачиОбработкиЗаявокПользователя.Выполнена
	|	И ЗадачиОбработкиЗаявокПользователя.БизнесПроцесс = &БизнесПроцесс
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗадачиОбработкиЗаявокПользователя.ТочкаМаршрута";    
	ТипыБизнесПроцесса = Метаданные.Задачи.БТ_ЗадачиОбработкиЗаявокПользователя.СтандартныеРеквизиты.БизнесПроцесс.Тип.Типы();
	Для Каждого БизнесПроцесс Из ТипыБизнесПроцесса Цикл
		МетаданныеБизнесПроцесс = Метаданные.НайтиПоТипу(БизнесПроцесс);
		Если МетаданныеБизнесПроцесс = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если МетаданныеБизнесПроцесс.Реквизиты.Найти("Основание") = Неопределено  Тогда
			Продолжить;
		КонецЕсли;
		
		Запрос.Текст = Запрос.Текст + "
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ЗадачиОбработкиЗаявокПользователя.ТочкаМаршрута
		|ИЗ
		|	Задача.БТ_ЗадачиОбработкиЗаявокПользователя КАК ЗадачиОбработкиЗаявокПользователя
		|ГДЕ
		|	ЗадачиОбработкиЗаявокПользователя.Выполнена
		|	И ЗадачиОбработкиЗаявокПользователя.ТочкаМаршрута ЕСТЬ НЕ NULL 
		|	И НЕ ЗадачиОбработкиЗаявокПользователя.БизнесПроцесс = &БизнесПроцесс
		|	И ВЫРАЗИТЬ(ЗадачиОбработкиЗаявокПользователя.БизнесПроцесс КАК БизнесПроцесс."+МетаданныеБизнесПроцесс.Имя+").Основание = &БизнесПроцесс
		|	И ЗадачиОбработкиЗаявокПользователя.БизнесПроцесс ССЫЛКА БизнесПроцесс."+МетаданныеБизнесПроцесс.Имя+"
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗадачиОбработкиЗаявокПользователя.ТочкаМаршрута";    
		
	КонецЦикла;
	Запрос.УстановитьПараметр("БизнесПроцесс", Заявка);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ТочкаМаршрута");
КонецФункции

Функция ПолучитьСписокПройденныхТочекМаршрута(Заявка) Экспорт
	
	Запрос = Новый Запрос;	
	Запрос.Текст="ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЗадачиОбработкиЗаявокПользователя.ТочкаМаршрута КАК ТочкаМаршрута
		|ИЗ
		|	Задача.БТ_ЗадачиОбработкиЗаявокПользователя КАК ЗадачиОбработкиЗаявокПользователя
		|ГДЕ
		|	ЗадачиОбработкиЗаявокПользователя.Выполнена
		|	И ЗадачиОбработкиЗаявокПользователя.ТочкаМаршрута ЕСТЬ НЕ NULL 
 |	И ЗадачиОбработкиЗаявокПользователя.БизнесПроцесс = &БизнесПроцесс";   
	Запрос.УстановитьПараметр("БизнесПроцесс", Заявка);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ТочкаМаршрута");
	
КонецФункции

Функция ПолучитьТекущуюЗадачуУтверждения(Заявка) Экспорт
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ РАЗРЕШЕННЫЕ
	             |	ЗадачиУтверждения.Ссылка КАК ЗадачаУтверждения
	             |ИЗ
	             |	Задача.БТ_ЗадачиОбработкиЗаявокПользователя КАК ЗадачиОбработкиЗаявокПользователя
	             |		ЛЕВОЕ СОЕДИНЕНИЕ Задача.БТ_ЗадачиУтверждения КАК ЗадачиУтверждения
	             |		ПО ЗадачиОбработкиЗаявокПользователя.Ссылка = ЗадачиУтверждения.БизнесПроцесс.ВедущаяЗадача
	             |			И (НЕ ЗадачиУтверждения.Выполнена)
	             |ГДЕ
	             |	НЕ ЗадачиОбработкиЗаявокПользователя.Выполнена
	             |	И ЗадачиОбработкиЗаявокПользователя.БизнесПроцесс = &БизнесПроцесс
	             |	И НЕ ЗадачиУтверждения.Ссылка ЕСТЬ NULL";
	Запрос.УстановитьПараметр("БизнесПроцесс", Заявка);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ЗадачаУтверждения");
КонецФункции

Функция ПолучитьТекущуюЗадачуУтверждения_Нов(Заявка) Экспорт
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ РАЗРЕШЕННЫЕ
	             |	ЗадачиУтверждения.Ссылка КАК ЗадачаУтверждения
	             |ИЗ
	             |	Задача.БТ_ЗадачиУтверждения КАК ЗадачиУтверждения
	             |ГДЕ
	             |	ЗадачиУтверждения.Заявка = &Заявка
	             |	И НЕ ЗадачиУтверждения.Выполнена";
	Запрос.УстановитьПараметр("Заявка", Заявка);
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ЗадачаУтверждения");
КонецФункции

Функция ПолучитьОтветственныхПоТочкеМаршрута(Заявка, ТочкаМаршрута) Экспорт
	ТекстОтветственных="";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ЗадачиОбработкиЗаявокПользователя.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ЗадачиОЗП
		|ИЗ
		|	Задача.БТ_ЗадачиОбработкиЗаявокПользователя КАК ЗадачиОбработкиЗаявокПользователя
		|ГДЕ
		|	ЗадачиОбработкиЗаявокПользователя.БизнесПроцесс = &БизнесПроцесс
		|	И ЗадачиОбработкиЗаявокПользователя.ТочкаМаршрута = &ТочкаМаршрута
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	УтвержденияЗаявок.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ БПУтв
		|ИЗ
		|	БизнесПроцесс.БТ_УтвержденияЗаявок КАК УтвержденияЗаявок
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗадачиОЗП КАК ЗадачиОЗП
		|		ПО УтвержденияЗаявок.ВедущаяЗадача = ЗадачиОЗП.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадачиУтверждения.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ЗадачиУтв
		|ИЗ
		|	Задача.БТ_ЗадачиУтверждения КАК ЗадачиУтверждения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ БПУтв КАК БПУтв
		|		ПО ЗадачиУтверждения.БизнесПроцесс = БПУтв.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ОтветственныеПоЗаявкамПользователей.Согласующий КАК Исполнитель
		|ИЗ
		|	ЗадачиУтв КАК ЗадачиУтв
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.БТ_ОтветственныеПоЗаявкамПользователей КАК ОтветственныеПоЗаявкамПользователей
		|		ПО ЗадачиУтв.Ссылка.Заявка = ОтветственныеПоЗаявкамПользователей.ЗаявкаПользователя
		|			И ЗадачиУтв.Ссылка.Роль = ОтветственныеПоЗаявкамПользователей.Роль";

	Запрос.УстановитьПараметр("ТекущаяДата"		, ТекущаяДата());
	Запрос.УстановитьПараметр("Пользователь"	, ПараметрыСеанса.Пользователь);
	Запрос.УстановитьПараметр("БизнесПроцесс"	, Заявка);
	Запрос.УстановитьПараметр("ТочкаМаршрута"	, ТочкаМаршрута);

	ВыборкаБизнесПроцессНомерУтверждаемойСтрокиТЧ = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);

	Пока ВыборкаБизнесПроцессНомерУтверждаемойСтрокиТЧ.Следующий() Цикл
		
		Если ВыборкаБизнесПроцессНомерУтверждаемойСтрокиТЧ.Количество()>1 Тогда
			ТекстОтветственных = ТекстОтветственных + "Строка " + ВыборкаБизнесПроцессНомерУтверждаемойСтрокиТЧ.НомерУтверждаемойСтрокиТЧ+":"+Символы.ПС;
		КонецЕсли;
		
		ВыборкаДетальныеЗаписи = ВыборкаБизнесПроцессНомерУтверждаемойСтрокиТЧ.Выбрать();

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ТекстОтветственных = ТекстОтветственных + "   Ответственный: " + ВыборкаДетальныеЗаписи.Исполнитель + Символы.ПС;
		КонецЦикла;
	КонецЦикла;
	Возврат ТекстОтветственных; 
КонецФункции

Функция ПолучитьСоответсвиеРолей(Заявка)

	ТипЗаявки = ТипЗнч(Заявка);
	
	Если ТипЗаявки = Тип("БизнесПроцессСсылка.БТ_СогласованиеЗаявокДДС") Тогда
		
		Возврат БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ПолучитьСоответсвиеРолейИТочекМаршрута()
		
	КонецЕсли;
	
	
КонецФункции

Функция ПолучитьСписокАктуальныхТочекМаршрута(Заявка) 

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	БТ_ОтветственныеПоЗаявкамПользователей.Роль КАК Роль
		|ИЗ
		|	РегистрСведений.БТ_ОтветственныеПоЗаявкамПользователей КАК БТ_ОтветственныеПоЗаявкамПользователей
		|ГДЕ
		|	БТ_ОтветственныеПоЗаявкамПользователей.ЗаявкаПользователя = &ЗаявкаПользователя";
	
	Запрос.УстановитьПараметр("ЗаявкаПользователя", Заявка);
	
	РезультатЗапроса 		= Запрос.Выполнить();   
	СоответсвиеРолей 		= ПолучитьСоответсвиеРолей(Заявка);
	ВыборкаДетальныеЗаписи 	= РезультатЗапроса.Выбрать();
	
	СписокТочекМаршрута 	= Новый СписокЗначений;
	СписокТочекНаУдаление 	= Новый СписокЗначений;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СписокТочекМаршрута.Добавить(СоответсвиеРолей.Получить(ВыборкаДетальныеЗаписи.Роль));
		
	КонецЦикла;               
	
	Для Каждого ТекСтр из СоответсвиеРолей Цикл
		
		Если СписокТочекМаршрута.НайтиПоЗначению(ТекСтр.Значение) = Неопределено Тогда
			
			СписокТочекНаУдаление.Добавить(ТекСтр.Значение) 
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Новый Структура("СписокТочекМаршрута, СписокТочекНаУдаление", СписокТочекМаршрута, СписокТочекНаУдаление);
	
КонецФункции

Функция СформироватьКартуМаршрута(Заявка) Экспорт
	ВидЗаявки		= Перечисления.БТ_ВидыЗаявок.ПолучитьВидЗаявки(Заявка);
	 
	Макет = БизнесПроцессы.БТ_СогласованиеЗаявокДДС.ПолучитьМакет("Карта_Заявка");
	Макет.ЭлементыГрафическойСхемы.НадписьБизнесПроцессЗавершен.ЦветТекста=?(Заявка.Завершен, WebЦвета.Черный, WebЦвета.Белый);

	Если Заявка.Отменен Тогда 
		
		Макет.ЭлементыГрафическойСхемы.НадписьБизнесПроцессЗавершен.Наименование = НСТР("ru='Заявка отменена.';en='Application canceled.'") + Символы.ПС + Заявка.ПричинаОтменыЗаявки + Символы.ПС + НСТР("ru='Отклонил: ';en='Rejected: '") + Заявка.Отклонил;//«18/07/16 Евтушенко Владимир 000078439»
		
	Иначе
		
		Макет.ЭлементыГрафическойСхемы.НадписьБизнесПроцессЗавершен.Наименование = "";
		
	КонецЕсли; 
	
	ТочкиМарштура = ПолучитьСписокАктуальныхТочекМаршрута(Заявка);
	
	Для Каждого Точка Из ТочкиМарштура.СписокТочекНаУдаление Цикл
		
		Попытка
			
			Макет.ЭлементыГрафическойСхемы[Точка.Значение.Имя].ЦветФона   = WebЦвета.Белый;
			Макет.ЭлементыГрафическойСхемы[Точка.Значение.Имя].ЦветТекста = WebЦвета.Белый;
			
		Исключение
			
		КонецПопытки;
				
	КонецЦикла;
	
	СписокТекущихТочекМаршрута	= ПолучитьСписокПройденныхТочекМаршрута(Заявка);
	Для Каждого Точка Из СписокТекущихТочекМаршрута Цикл  
		
		Если Точка = Неопределено Тогда                  
			
			Продолжить; 
			
		КонецЕсли;
		
		Попытка
		
			Макет.ЭлементыГрафическойСхемы[Точка.Имя].ЦветРамки	= WebЦвета.Черный;
			Макет.ЭлементыГрафическойСхемы[Точка.Имя].ЦветФона 	= WebЦвета.БледноЗеленый;
			Макет.ЭлементыГрафическойСхемы[Точка.Имя].Подсказка	= ПолучитьОтветственныхПоТочкеМаршрута(Заявка, Точка);
			
		Исключение
		КонецПопытки;
		
	КонецЦикла;
	
	Если Не Заявка.Завершен Тогда  
		
		СписокТекущихТочекМаршрута = ПолучитьСписокТекущихТочекМаршрута(Заявка);  
		
		Для Каждого Точка Из СписокТекущихТочекМаршрута Цикл
			Попытка
				
				Макет.ЭлементыГрафическойСхемы[Точка.Имя].ЦветРамки		= WebЦвета.Черный;
				Макет.ЭлементыГрафическойСхемы[Точка.Имя].Рамка			= Новый Линия(ТипСоединительнойЛинии.Пунктир, 1);
				Макет.ЭлементыГрафическойСхемы[Точка.Имя].ЦветФона 		= WebЦвета.Лосось;
				Макет.ЭлементыГрафическойСхемы[Точка.Имя].ЦветТекста 	= WebЦвета.Белый;
				
				Макет.ЭлементыГрафическойСхемы[Точка.Имя].Подсказка		= ПолучитьОтветственныхПоТочкеМаршрута(Заявка, Точка);
				
			Исключение
			КонецПопытки;
		КонецЦикла;
	КонецЕсли;	
	
	Возврат Макет;
КонецФункции
